bench-results/slimio_redis_fdp_disabled_always/0/summary_1.txt
====== SET ======
  28835840 requests completed in 839.42 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.375 milliseconds (cumulative count 2)
50.000% <= 1.239 milliseconds (cumulative count 14673732)
75.000% <= 1.455 milliseconds (cumulative count 21690970)
87.500% <= 1.687 milliseconds (cumulative count 25248781)
93.750% <= 1.983 milliseconds (cumulative count 27067879)
96.875% <= 2.183 milliseconds (cumulative count 27958094)
98.438% <= 2.327 milliseconds (cumulative count 28389436)
99.219% <= 2.455 milliseconds (cumulative count 28611630)
99.609% <= 2.599 milliseconds (cumulative count 28723870)
99.805% <= 2.791 milliseconds (cumulative count 28781121)
99.902% <= 2.975 milliseconds (cumulative count 28807873)
99.951% <= 3.207 milliseconds (cumulative count 28821859)
99.976% <= 6.479 milliseconds (cumulative count 28828800)
99.988% <= 8.183 milliseconds (cumulative count 28832337)
99.994% <= 10.447 milliseconds (cumulative count 28834080)
99.997% <= 275.967 milliseconds (cumulative count 28834961)
99.998% <= 1741.823 milliseconds (cumulative count 28835401)
99.999% <= 1798.143 milliseconds (cumulative count 28835624)
100.000% <= 1862.655 milliseconds (cumulative count 28835744)
100.000% <= 1864.703 milliseconds (cumulative count 28835790)
100.000% <= 1960.959 milliseconds (cumulative count 28835819)
100.000% <= 1961.983 milliseconds (cumulative count 28835840)
100.000% <= 1961.983 milliseconds (cumulative count 28835840)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.000% <= 0.407 milliseconds (cumulative count 8)
0.001% <= 0.503 milliseconds (cumulative count 316)
0.010% <= 0.607 milliseconds (cumulative count 2828)
0.105% <= 0.703 milliseconds (cumulative count 30401)
4.871% <= 0.807 milliseconds (cumulative count 1404519)
8.927% <= 0.903 milliseconds (cumulative count 2574192)
20.620% <= 1.007 milliseconds (cumulative count 5946015)
31.660% <= 1.103 milliseconds (cumulative count 9129287)
46.190% <= 1.207 milliseconds (cumulative count 13319329)
59.906% <= 1.303 milliseconds (cumulative count 17274258)
71.075% <= 1.407 milliseconds (cumulative count 20495035)
78.931% <= 1.503 milliseconds (cumulative count 22760358)
84.725% <= 1.607 milliseconds (cumulative count 24431275)
88.010% <= 1.703 milliseconds (cumulative count 25378412)
90.496% <= 1.807 milliseconds (cumulative count 26095141)
92.375% <= 1.903 milliseconds (cumulative count 26637215)
94.303% <= 2.007 milliseconds (cumulative count 27193070)
95.864% <= 2.103 milliseconds (cumulative count 27643084)
99.936% <= 3.103 milliseconds (cumulative count 28817529)
99.973% <= 4.103 milliseconds (cumulative count 28828000)
99.975% <= 5.103 milliseconds (cumulative count 28828538)
99.975% <= 6.103 milliseconds (cumulative count 28828667)
99.978% <= 7.103 milliseconds (cumulative count 28829506)
99.987% <= 8.103 milliseconds (cumulative count 28832128)
99.992% <= 9.103 milliseconds (cumulative count 28833574)
99.994% <= 10.103 milliseconds (cumulative count 28834019)
99.994% <= 11.103 milliseconds (cumulative count 28834205)
99.995% <= 12.103 milliseconds (cumulative count 28834336)
99.996% <= 13.103 milliseconds (cumulative count 28834546)
99.996% <= 14.103 milliseconds (cumulative count 28834565)
99.996% <= 15.103 milliseconds (cumulative count 28834574)
99.996% <= 23.103 milliseconds (cumulative count 28834586)
99.996% <= 24.111 milliseconds (cumulative count 28834604)
99.996% <= 36.127 milliseconds (cumulative count 28834612)
99.996% <= 37.119 milliseconds (cumulative count 28834632)
99.996% <= 41.119 milliseconds (cumulative count 28834648)
99.996% <= 42.111 milliseconds (cumulative count 28834659)
99.996% <= 52.127 milliseconds (cumulative count 28834663)
99.996% <= 53.119 milliseconds (cumulative count 28834686)
99.996% <= 54.111 milliseconds (cumulative count 28834687)
99.996% <= 61.119 milliseconds (cumulative count 28834714)
99.996% <= 62.111 milliseconds (cumulative count 28834715)
99.996% <= 63.103 milliseconds (cumulative count 28834734)
99.996% <= 64.127 milliseconds (cumulative count 28834761)
99.996% <= 65.119 milliseconds (cumulative count 28834802)
99.996% <= 66.111 milliseconds (cumulative count 28834806)
99.996% <= 78.143 milliseconds (cumulative count 28834810)
99.997% <= 79.103 milliseconds (cumulative count 28834834)
99.997% <= 105.151 milliseconds (cumulative count 28834835)
99.997% <= 106.111 milliseconds (cumulative count 28834858)
99.997% <= 107.135 milliseconds (cumulative count 28834860)
99.997% <= 109.119 milliseconds (cumulative count 28834887)
99.997% <= 110.143 milliseconds (cumulative count 28834890)
99.997% <= 260.223 milliseconds (cumulative count 28834920)
99.997% <= 263.167 milliseconds (cumulative count 28834947)
99.997% <= 264.191 milliseconds (cumulative count 28834948)
99.997% <= 276.223 milliseconds (cumulative count 28834970)
99.997% <= 282.111 milliseconds (cumulative count 28834985)
99.997% <= 283.135 milliseconds (cumulative count 28834990)
99.997% <= 1551.359 milliseconds (cumulative count 28834998)
99.997% <= 1552.383 milliseconds (cumulative count 28835020)
99.997% <= 1613.823 milliseconds (cumulative count 28835046)
99.997% <= 1640.447 milliseconds (cumulative count 28835065)
99.997% <= 1641.471 milliseconds (cumulative count 28835073)
99.997% <= 1650.687 milliseconds (cumulative count 28835096)
99.997% <= 1658.879 milliseconds (cumulative count 28835102)
99.997% <= 1659.903 milliseconds (cumulative count 28835116)
99.998% <= 1671.167 milliseconds (cumulative count 28835142)
99.998% <= 1675.263 milliseconds (cumulative count 28835160)
99.998% <= 1676.287 milliseconds (cumulative count 28835166)
99.998% <= 1678.335 milliseconds (cumulative count 28835201)
99.998% <= 1711.103 milliseconds (cumulative count 28835225)
99.998% <= 1712.127 milliseconds (cumulative count 28835228)
99.998% <= 1716.223 milliseconds (cumulative count 28835244)
99.998% <= 1717.247 milliseconds (cumulative count 28835255)
99.998% <= 1724.415 milliseconds (cumulative count 28835283)
99.998% <= 1725.439 milliseconds (cumulative count 28835310)
99.998% <= 1727.487 milliseconds (cumulative count 28835338)
99.998% <= 1728.511 milliseconds (cumulative count 28835381)
99.998% <= 1729.535 milliseconds (cumulative count 28835386)
99.998% <= 1741.823 milliseconds (cumulative count 28835401)
99.999% <= 1752.063 milliseconds (cumulative count 28835424)
99.999% <= 1763.327 milliseconds (cumulative count 28835452)
99.999% <= 1770.495 milliseconds (cumulative count 28835479)
99.999% <= 1775.615 milliseconds (cumulative count 28835502)
99.999% <= 1776.639 milliseconds (cumulative count 28835521)
99.999% <= 1777.663 milliseconds (cumulative count 28835526)
99.999% <= 1782.783 milliseconds (cumulative count 28835551)
99.999% <= 1783.807 milliseconds (cumulative count 28835554)
99.999% <= 1784.831 milliseconds (cumulative count 28835576)
99.999% <= 1791.999 milliseconds (cumulative count 28835577)
99.999% <= 1793.023 milliseconds (cumulative count 28835596)
99.999% <= 1798.143 milliseconds (cumulative count 28835624)
99.999% <= 1806.335 milliseconds (cumulative count 28835637)
99.999% <= 1807.359 milliseconds (cumulative count 28835646)
99.999% <= 1827.839 milliseconds (cumulative count 28835655)
99.999% <= 1828.863 milliseconds (cumulative count 28835674)
100.000% <= 1835.007 milliseconds (cumulative count 28835696)
100.000% <= 1841.151 milliseconds (cumulative count 28835718)
100.000% <= 1862.655 milliseconds (cumulative count 28835744)
100.000% <= 1863.679 milliseconds (cumulative count 28835780)
100.000% <= 1864.703 milliseconds (cumulative count 28835790)
100.000% <= 1959.935 milliseconds (cumulative count 28835803)
100.000% <= 1960.959 milliseconds (cumulative count 28835819)
100.000% <= 1961.983 milliseconds (cumulative count 28835840)

Summary:
  throughput summary: 34352.10 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        1.349     0.368     1.239     2.055     2.415  1961.983